tap "homebrew/bundle"       # First line of a bundle
tap "homebrew/cask"         # Not needed on command line
tap "homebrew/cask-fonts"   # Just needed for font casks below
tap "homebrew/core"         # Not needed on command line

# Building tools
brew "boost"        # C++ library
brew "ccache"       # Faster builds by caching
brew "cmake"        # Build software projects
brew "ninja"        # Replacement for make
brew "doxygen"      # Doxygen generates C++ documentation
brew "swig"         # Software wrapper interface generator

# General utilities
brew "colordiff"    # More colorful diffs outside of git
brew "coreutils"    # Basic stuff with a g prefix
brew "gnu-sed"      # Adds the gsed command, more powerful than BSD sed
brew "gnu-time"     # Nicer timing
brew "openssl"      # Security stuff
brew "git"          # The latest version of git instead of Apple's older one
brew "htop"         # htop is better than top for checking processes
brew "tree"         # tree is nice for looking at directories
brew "wget"         # Mac's have curl by default, but not wget
brew "bash"         # Bash 5 instead of 3, in case you need it
brew "rename"       # Rename files utility
brew "clang-format" # Format C++ files
brew "tmux"         # Split windows and saving terminal sessions (screen replacement)

# Programming languages
brew "python"       # Python 3
brew "numpy"        # Now is Python3 only (numpy@1.16 is for python@2)
brew "go"           # Used by hugo, can be useful to have
brew "node"         # Javascript (for gitbooks, etc)
brew "yarn"         # Package manager for node.js
brew "ruby"         # Just to be extra sure the system Ruby never gets modified
brew "rbenv"        # Use this for ruby
brew "rust"         # Was trying out mdbook
brew "lua"          # Lightweight language like Python

brew "jupyterlab"   # Programming environment

# Packages
brew "pandoc"       # Convert between document formats
brew "pdftk-java"   # PDF Tool Kit (Java port)
brew "qt"           # The #1 graphics library for C++ and Python


# Fonts
cask "font-hack-nerd-font"
cask "font-sourcecodepro-nerd-font"

# Core
cask "iterm2"       # A great terminal
cask "java"         # Meh. What can I say?
cask "mactex"       # LaTeX. Huge.
cask "miniconda"    # Nice way to get a system Conda install

# Programs
cask "google-chrome"# Since once and a while a site doesn't work with Safari
cask "gimp"         # Photo editor
cask "blender"      # The 3D application

# Editors
cask "macdown"      # Nice Markdown
cask "texstudio"    # Nice IDE for LaTeX
cask "meld"         # Compare files graphically.

